class AccordionQuestions:
    ACCORDION_QUESTION_0_PRICE = "Сколько это стоит? И как оплатить?"
    ACCORDION_QUESTION_1_QUANTITY = "Хочу сразу несколько самокатов! Так можно?"
    ACCORDION_QUESTION_2_TIME = "Как рассчитывается время аренды?"
    ACCORDION_QUESTION_3_DATE = "Можно ли заказать самокат прямо на сегодня?"
    ACCORDION_QUESTION_4_PERIOD = "Можно ли продлить заказ или вернуть самокат раньше?"
    ACCORDION_QUESTION_5_ENERGY = "Вы привозите зарядку вместе с самокатом?"
    ACCORDION_QUESTION_6_CLOSE = "Можно ли отменить заказ?"
    ACCORDION_QUESTION_7_PLACE = "Я жизу за МКАДом, привезёте?"


class AccordionAnswers:
    ACCORDION_ANSWER_0_PRICE = "Сутки — 400 рублей. Оплата курьеру — наличными или картой."
    ACCORDION_ANSWER_1_QUANTITY = "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим."
    ACCORDION_ANSWER_2_TIME = (
        "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт "
        "времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли "
        "самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.")
    ACCORDION_ANSWER_3_DATE = "Только начиная с завтрашнего дня. Но скоро станем расторопнее."
    ACCORDION_ANSWER_4_PERIOD = ("Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по "
                                      "красивому номеру 1010.")
    ACCORDION_ANSWER_5_ENERGY = (
        "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если "
        "будете кататься без передышек и во сне. Зарядка не понадобится.")
    ACCORDION_ANSWER_6_CLOSE = ("Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не "
                                    "попросим. Все же свои.")
    ACCORDION_ANSWER_7_PLACE = "Да, обязательно. Всем самокатов! И Москве, и Московской области."
